"""
Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

Ввод: значение типа <float>
Вывод: значение типа <int>

Примеры:
6782.0
23

0.56
11
"""

num = input('Число = ')
sum_num = 0
sum_num = sum([int(lm) for lm in num if lm.isdigit()])
print(f'Сумма цифр числа {num} равна {sum_num}')
