"""
Напишите программу, которая принимает на вход натуральное число N и выдает список факториалов по основаниям от 1 до N

Ввод: значение типа <int>
Вывод: значение типа <list>

Пример:
4
[1, 2, 6, 24]
"""
num = int(input('Введите число: '))
new_list = []
f = 1
for i in range(1, num + 1):
    f *= i
    new_list.append(f)
print(new_list)
