"""
Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

Ввод: значение типа <float>
Вывод: значение типа <int>

Примеры:
6782.0
23

0.56
11
"""
numbers = input('Число = ')
sum = 0
for i in numbers:
    if i != '.':
        sum = int (i) + sum
print(f'Сумма цифр числа {numbers} равна {sum}')